docs/recs/change dates/Flow_With_EMD_INF_MultiLeg_25-9-2018/Flow_MultiLeg_to_Direct_Flight/7-ARR_ExecuteReprice.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:sita="http://schemas.datacontract.org/2004/07/Sita.Services.ARR" xmlns:sita1="http://schemas.datacontract.org/2004/07/Sita.Services.HalService" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:sita2="http://schemas.datacontract.org/2004/07/Sita.Services.SWF" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header>
		<hal:Config subscriberId="7I" xmlns:hal="http://sita.aero/hal"/>
	</soapenv:Header>
	<soapenv:Body>
		<tem:ARR_ExecuteReprice>
			<tem:sessionID>393ebc79-aa63-4aad-b68d-4d0cc25342d6</tem:sessionID>
			<tem:ARR_ExecuteRepriceRQ>
				<sita:baggageInfoField>
					<sita:newBaggageIndField>false</sita:newBaggageIndField>
				</sita:baggageInfoField>
				<sita:commissionField xsi:nil="true"/>
				<sita:endorsementsField>
					<arr:string xsi:nil="true"/>
				</sita:endorsementsField>
				<sita:passengerInfoField>
					<sita:additionalPassengerInfoField>ADT</sita:additionalPassengerInfoField>
					<sita:emailAddressField>V.KASIMATIS@JRTECHNOLOGIES.COM</sita:emailAddressField>
					<sita:emailIndicatorField>true</sita:emailIndicatorField>
					<sita:sequenceNumberField>1</sita:sequenceNumberField>
					<sita:ticketingInfoField>
						<sita2:airlineAccountingCodeField>958</sita2:airlineAccountingCodeField>
						<sita2:formAndSerialNumberField>4321010995</sita2:formAndSerialNumberField>
						<sita:salesReportInfoField xsi:nil="true"/>
						<sita:sponsorInfoField xsi:nil="true"/>
						<sita:tourCodeField xsi:nil="true"/>
					</sita:ticketingInfoField>
				</sita:passengerInfoField>
				<sita:paymentDetailsField>
				
				</sita:paymentDetailsField>
				<sita:penaltyField xsi:nil="true"/>
			</tem:ARR_ExecuteRepriceRQ>
		</tem:ARR_ExecuteReprice>
	</soapenv:Body>
</soapenv:Envelope>
